RAKWireless/RAK-nRF52-RUI/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
# Copyright (c) 2017 Adafruit Industries.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.softdevice=Bootloader
menu.debug=Debug
menu.supportnfc=Support NFC

# ----------------------------------
# WisBlock Core RAK4630 Board
# ----------------------------------
WisCoreRAK4631Board.name=WisBlock Core RAK4631 Board
WisCoreRAK4631Board.bootloader.tool=bootburn
WisCoreRAK4631Board.build.variant_h=variant_{build.board}.h
WisCoreRAK4631Board.build.series=rak4630

# Upload
WisCoreRAK4631Board.upload.tool=uploader
WisCoreRAK4631Board.upload.protocol=uploader
WisCoreRAK4631Board.upload.use_1200bps_touch=true
WisCoreRAK4631Board.upload.wait_for_upload_port=true
WisCoreRAK4631Board.upload.maximum_size=557056
WisCoreRAK4631Board.upload.maximum_data_size=206448

# Build
WisCoreRAK4631Board.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
WisCoreRAK4631Board.build.f_cpu=64000000
WisCoreRAK4631Board.build.board=WisCore_RAK4631_Board
WisCoreRAK4631Board.build.core=nRF5
WisCoreRAK4631Board.build.variant=WisCore_RAK4631_Board
WisCoreRAK4631Board.build.usb_manufacturer="RAKwireless"
WisCoreRAK4631Board.build.usb_product="WisCore RAK4631 Board"
WisCoreRAK4631Board.build.extra_flags=-DNRF52840_XXAA -DRAK4631_V2.0+RAK5005-O_V1.0 -Drak4630 -DWISBLOCK_BASE_5005_O {build.flags.usb}
WisCoreRAK4631Board.build.ldscript=flash_nrf52840.ld
WisCoreRAK4631Board.build.vid=0x239A
WisCoreRAK4631Board.build.pid=0x8029

# SoftDevice Menu
WisCoreRAK4631Board.menu.softdevice.s140v6=0.3.2 SoftDevice s140 7.2.0
WisCoreRAK4631Board.menu.softdevice.s140v6.build.sd_name=s140
WisCoreRAK4631Board.menu.softdevice.s140v6.build.sd_version=7.2.0
WisCoreRAK4631Board.menu.softdevice.s140v6.build.sd_fwid=0x0100

# Debug Menu
WisCoreRAK4631Board.menu.debug.l0=Level 0 (Release)
WisCoreRAK4631Board.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
WisCoreRAK4631Board.menu.debug.l1=Level 1 (Error Message)
WisCoreRAK4631Board.debug.l1.build.debug_flags=-DCFG_DEBUG=1
WisCoreRAK4631Board.menu.debug.l2=Level 2 (Full Debug)
WisCoreRAK4631Board.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
WisCoreRAK4631Board.menu.debug.l3=Level 3 (Segger SystemView)
WisCoreRAK4631Board.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
WisCoreRAK4631Board.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Support NFC Menu
WisCoreRAK4631Board.menu.supportnfc.1= Disable
WisCoreRAK4631Board.menu.supportnfc.1.build.nfc_flag=-DCONFIG_NFCT_PINS_AS_GPIOS
WisCoreRAK4631Board.menu.supportnfc.2= Enable
WisCoreRAK4631Board.menu.supportnfc.2.build.nfc_flag=-DSUPPORT_NFC -UCONFIG_NFCT_PINS_AS_GPIOS

